Table of Contents
 Class PointOfID
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Point of interaction diagram
[Obfuscation(Feature = "renaming")]
public class PointOfID
Inheritance
object
PointOfID
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 My
Bending moment around y-axis
public double My { get; set; }
Property Value
double
 Mz
Bending moment around z-axis
public double Mz { get; set; }
Property Value
double
 N
Normal force
public double N { get; set; }
Property Value
double
 Edit this page